I'm observing a possible race condition: despite successful `apply`, a subsequent `plan` shows a missing custom tag that needs to be recreated.
```shellsession
$ terraform apply -auto-approve -var value=0
data.vault_kv_secret_v2.secret_dynatrace: Reading...
data.vault_kv_secret_v2.secret_dynatrace: Read complete after 0s [id=secret/data/dynatrace.app0000343/dynatrace-test]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # dynatrace_application_detection_rule.minimal will be created
  + resource "dynatrace_application_detection_rule" "minimal" {
      + application_identifier = (known after apply)
      + id                     = (known after apply)

      + filter_config {
          + application_match_target = "DOMAIN"
          + application_match_type   = "MATCHES"
          + pattern                  = "domain"
        }
    }

  # dynatrace_custom_tags.minimal will be created
  + resource "dynatrace_custom_tags" "minimal" {
      + current_state    = (known after apply)
      + entity_selector  = (known after apply)
      + id               = (known after apply)
      + matched_entities = (known after apply)

      + tags {
          + filter {
              + context = "CONTEXTLESS"
              + key     = "key"
              + value   = "0"
            }
        }
    }

  # dynatrace_web_application.minimal will be created
  + resource "dynatrace_web_application" "minimal" {
      + cost_control_user_session_percentage = 100
      + id                                   = (known after apply)
      + load_action_key_performance_metric   = "VISUALLY_COMPLETE"
      + name                                 = "minimal"
      + type                                 = "AUTO_INJECTED"
      + xhr_action_key_performance_metric    = "VISUALLY_COMPLETE"

      + custom_action_apdex_settings {
          + frustrating_fallback_threshold = 12000
          + frustrating_threshold          = 12000
          + tolerated_fallback_threshold   = 3000
          + tolerated_threshold            = 3000
        }

      + load_action_apdex_settings {
          + frustrating_fallback_threshold = 12000
          + frustrating_threshold          = 12000
          + tolerated_fallback_threshold   = 3000
          + tolerated_threshold            = 3000
        }

      + monitoring_settings {
          + injection_mode = "JAVASCRIPT_TAG"

          + advanced_javascript_tag_settings {
              + max_action_name_length = 100
              + max_errors_to_capture  = 10

              + additional_event_handlers {
                  + max_dom_nodes = 5000
                }

              + global_event_capture_settings {}
            }

          + content_capture {
              + resource_timing_settings {
                  + instrumentation_delay = 50
                }
              + timeout_settings {
                  + temporary_action_limit         = 0
                  + temporary_action_total_timeout = 100
                }
            }

          + javascript_framework_support {}
        }

      + user_action_naming_settings {
        }

      + waterfall_settings {
          + resource_browser_caching_threshold            = 50
          + resources_threshold                           = 100000
          + slow_cnd_resources_threshold                  = 200000
          + slow_first_party_resources_threshold          = 200000
          + slow_third_party_resources_threshold          = 200000
          + speed_index_visually_complete_ratio_threshold = 50
          + uncompressed_resources_threshold              = 860
        }

      + xhr_action_apdex_settings {
          + frustrating_fallback_threshold = 12000
          + frustrating_threshold          = 12000
          + tolerated_fallback_threshold   = 3000
          + tolerated_threshold            = 3000
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id = {}
dynatrace_web_application.minimal: Creating...
dynatrace_web_application.minimal: Still creating... [10s elapsed]
dynatrace_web_application.minimal: Creation complete after 11s [id=APPLICATION-AED486152F8B2622]
dynatrace_application_detection_rule.minimal: Creating...
dynatrace_custom_tags.minimal: Creating...
dynatrace_custom_tags.minimal: Creation complete after 0s [id=17ec300d-23fe-4d96-83cc-a0f5980d926e]
dynatrace_application_detection_rule.minimal: Creation complete after 0s [id=59705370-17f7-3202-80ab-902cd60b0405]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

id = {
  "dynatrace_application_detection_rule" = "59705370-17f7-3202-80ab-902cd60b0405"
  "dynatrace_custom_tags" = "17ec300d-23fe-4d96-83cc-a0f5980d926e"
  "dynatrace_web_application" = "APPLICATION-AED486152F8B2622"
}
$ terraform plan -var value=0
data.vault_kv_secret_v2.secret_dynatrace: Reading...
data.vault_kv_secret_v2.secret_dynatrace: Read complete after 0s [id=secret/data/dynatrace.app0000343/dynatrace-test]
dynatrace_web_application.minimal: Refreshing state... [id=APPLICATION-AED486152F8B2622]
dynatrace_application_detection_rule.minimal: Refreshing state... [id=59705370-17f7-3202-80ab-902cd60b0405]
dynatrace_custom_tags.minimal: Refreshing state... [id=17ec300d-23fe-4d96-83cc-a0f5980d926e]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  ~ update in-place

Terraform will perform the following actions:

  # dynatrace_application_detection_rule.minimal will be updated in-place
  ~ resource "dynatrace_application_detection_rule" "minimal" {
        id                     = "59705370-17f7-3202-80ab-902cd60b0405"
      - name                   = "59705370-17f7-3202-80ab-902cd60b0405" -> null
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # dynatrace_custom_tags.minimal will be updated in-place
  ~ resource "dynatrace_custom_tags" "minimal" {
        id               = "17ec300d-23fe-4d96-83cc-a0f5980d926e"
        # (3 unchanged attributes hidden)

      + tags {
          + filter {
              + context = "CONTEXTLESS"
              + key     = "key"
              + value   = "0"
            }
        }
    }

  # dynatrace_web_application.minimal will be updated in-place
  ~ resource "dynatrace_web_application" "minimal" {
        id                                   = "APPLICATION-AED486152F8B2622"
        name                                 = "minimal"
        # (5 unchanged attributes hidden)

      ~ monitoring_settings {
          - add_cross_origin_anonymous_attribute = true -> null
          - script_tag_cache_duration_in_hours   = 1 -> null
            # (5 unchanged attributes hidden)

            # (3 unchanged blocks hidden)
        }

      - session_replay_config {
          - cost_control_percentage                = 100 -> null
          - css_resource_capturing_exclusion_rules = [] -> null
          - enable_css_resource_capturing          = true -> null
          - enabled                                = false -> null
        }

      ~ user_action_naming_settings {
          ~ query_parameter_cleanups       = [
              - "__sid",
              - "cfid",
              - "cftoken",
              - "phpsessid",
              - "sid",
            ]
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run
"terraform apply" now.
```

`curl` confirms that the tag is absent.
```shellsession
$ SECRET="$(vault kv get -format json -mount secret "$VAULT_ROLE"/dynatrace-test)"
$ OUTPUT="$(terraform output -json)"
$ . <(<<<"$SECRET" jq -r --argjson output "$OUTPUT" '.data
| [ "curl"
  , "-H"
  , "authorization: api-token \(.data.environment_REDACTED)"
  , "\(.metadata.custom_metadata.environment_REDACTED_uri_base)/api/v2/tags?entitySelector=entityId(\($output | .id.value.dynatrace_web_application))"
  ]
| @sh') | jq --tab
> > > > > >   % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100    26  100    26    0     0    117      0 --:--:-- --:--:-- --:--:--   117
{
	"totalCount": 0,
	"tags": []
}
``` 